tap "1password/tap"
tap "caarlos0/tap"
tap "coursier/formulas"
tap "homebrew/bundle"
tap "romkatv/powerlevel10k"
brew "act"
brew "asciinema"
brew "node"
brew "aws-cdk"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "boost"
brew "cloc"
brew "commitizen"
brew "diff-so-fancy"
brew "eksctl"
brew "ethereum"
brew "exercism"
brew "fasd"
brew "fd"
brew "gcc"
brew "unbound"
brew "ffmpeg"
brew "figlet"
brew "fortune"
brew "fzf"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "golangci-lint"
brew "sdl2_image"
brew "gource"
brew "graphviz"
brew "grep"
brew "psutils"
brew "ipython"
brew "openjdk"
brew "jetty"
brew "jq"
brew "openssl@1.1"
brew "kubernetes-cli"
brew "lazygit"
brew "luajit", args: ["HEAD"]
brew "maven"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "openapi-generator"
brew "pandoc"
brew "parallel"
brew "virtualenv"
brew "poetry"
brew "powerlevel10k"
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "ripgrep"
brew "spatialindex"
brew "terminal-notifier"
brew "tig"
brew "tmux"
brew "wget"
brew "yt-dlp"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "caarlos0/tap/timer"
brew "coursier/formulas/coursier"
cask "1password"
cask "1password-cli"
cask "anaconda"
cask "android-file-transfer"
cask "discord"
cask "docker"
cask "firefox"
cask "hiddenbar"
cask "inkdrop"
cask "iterm2"
cask "jetbrains-toolbox"
cask "ngrok"
cask "papers"
cask "raycast"
cask "spotify"
cask "stats"
cask "steam"
cask "visual-studio-code"
cask "warp"
cask "zed"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "jebbs.plantuml"
vscode "k--kato.intellij-idea-keybindings"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mathiasfrohlich.kotlin"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "nomicfoundation.hardhat-solidity"
vscode "perkovec.emoji"
vscode "pycom.pymakr"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "streetsidesoftware.code-spell-checker"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
