tap "1password/tap"
tap "caarlos0/tap"
tap "coursier/formulas"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
brew "asciinema"
brew "node"
brew "aws-cdk"
brew "awscli"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "boost"
brew "eksctl"
brew "exercism"
brew "fasd"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fortune"
brew "fzf"
brew "gcc"
brew "geckodriver"
brew "gh"
brew "git"
brew "go"
brew "sdl2_image"
brew "gource"
brew "graphviz"
brew "grep"
brew "ipython"
brew "jq"
brew "kubernetes-cli"
brew "lolcat"
brew "luajit", args: ["HEAD"]
brew "openjdk"
brew "maven"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "open-mpi"
brew "openapi-generator"
brew "pandoc"
brew "virtualenv"
brew "poetry"
brew "python@3.9"
brew "ripgrep"
brew "terminal-notifier"
brew "tig"
brew "tmux"
brew "vhs"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "caarlos0/tap/timer"
brew "coursier/formulas/coursier"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "1password"
cask "1password-cli"
cask "anaconda"
cask "android-file-transfer"
cask "discord"
cask "docker"
cask "firefox"
cask "gitkraken"
cask "inkdrop"
cask "iterm2"
cask "jetbrains-toolbox"
cask "maccy"
cask "ngrok"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "zotero"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "golang.go"
vscode "jebbs.plantuml"
vscode "k--kato.intellij-idea-keybindings"
vscode "mathiasfrohlich.Kotlin"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "Perkovec.emoji"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "streetsidesoftware.code-spell-checker"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
