tap "1password/tap"
tap "caarlos0/tap"
tap "coursier/formulas"
tap "homebrew/bundle"
tap "koekeishiya/formulae"
tap "romkatv/powerlevel10k"
brew "act"
brew "asciinema"
brew "node"
brew "aws-cdk"
brew "awscli"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "blueutil"
brew "boost"
brew "certifi"
brew "cloc"
brew "cmake"
brew "colima"
brew "diff-so-fancy"
brew "docker"
brew "docker-compose"
brew "exercism"
brew "fasd"
brew "fd"
brew "unbound"
brew "ffmpeg"
brew "figlet"
brew "fortune"
brew "fzf"
brew "gcc"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-lfs"
brew "glow"
brew "gnu-time"
brew "go"
brew "golangci-lint"
brew "sdl2_image"
brew "gource"
brew "graphviz"
brew "grep"
brew "ipython"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "llvm"
brew "lua"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "openjdk"
brew "maven"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "openapi-generator"
brew "openblas"
brew "openssl@1.1"
brew "parallel"
brew "poetry"
brew "powerlevel10k"
brew "psutils"
brew "pyenv"
brew "python@3.11"
brew "ranger"
brew "ripgrep"
brew "spatialindex"
brew "temporal"
brew "terminal-notifier"
brew "tig"
brew "tmux"
brew "tree"
brew "virtualenv"
brew "wget"
brew "yt-dlp"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "caarlos0/tap/timer"
brew "coursier/formulas/coursier"
cask "1password"
cask "1password-cli"
cask "android-file-transfer"
cask "chatgpt"
cask "dbeaver-community"
cask "discord"
cask "firefox"
cask "font-fira-code"
cask "ghostty"
cask "godot"
cask "hiddenbar"
cask "jetbrains-toolbox"
cask "minecraft"
cask "ngrok"
cask "notion"
cask "raycast"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "warp"
cask "zed"
cask "zulu@21"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "jebbs.plantuml"
vscode "johob.pico8-vscode"
vscode "k--kato.intellij-idea-keybindings"
vscode "kevinrose.vsc-python-indent"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mathiasfrohlich.kotlin"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "perkovec.emoji"
vscode "pkief.material-icon-theme"
vscode "pollywoggames.pico8-ls"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/jubenitezg/dupl"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/rogpeppe/godef"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/lint/golint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/jstemmer/gotags"
go "golang.org/x/tools/cmd/guru"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/keyify"
go "github.com/fatih/motion"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
